Importing Pandas Library

In [1]:
import pandas as pd # As gives the naming as "pd"

Pandas Series

Creating Pandas Series

A Pandas Series is like a column in a table. The difference between Numpy series and Pandas series is pandas series also hold indexes of values.

In [4]:
pd.Series([10,20,30,40,50]) # It return both indexes and values

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
s = pd.Series([10,20,30,40,50])
type(s)

pandas.core.series.Series

In [7]:
s.axes #Indexes of Series can be seen by "axes" attribute

[RangeIndex(start=0, stop=5, step=1)]

In [9]:
s.dtype # variable

dtype('int64')

In [11]:
s.size # Variable size

5

In [12]:
s.ndim # One-dimensional array

1

In [13]:
s.values #we can use "values" attribute if we want to see just values

array([10, 20, 30, 40, 50], dtype=int64)

In [14]:
s.head(2) #We can reach first values by head() function. specify number of rows you want to see. Default is 5.

0    10
1    20
dtype: int64

In [16]:
s.tail(3) #We can reach last values by tail() function. Specify number of rows you want to see. Default is 5.

2    30
3    40
4    50
dtype: int64

In [18]:
s[1] #Series can be indexed with selecting square brackets []. Indexes starts with 0.

20

Changing Index Label

In [19]:
pd.Series([13,14,334,565,334,45])

0     13
1     14
2    334
3    565
4    334
5     45
dtype: int64

In [21]:
pd.Series([13,14,15,16,17],index=[11,12,13,14,15]) #We can specify indexes.

11    13
12    14
13    15
14    16
15    17
dtype: int64

In [23]:
s = pd.Series([13,12,24,23,44],index=["first","second","third","fourth","fifth"]) #We can a Iso specify string indexex.
s

first     13
second    12
third     24
fourth    23
fifth     44
dtype: int64

In [24]:
s["fifth"]

44

Creating series key/value object (Dictionary)

You can also use a key / value object, like a dictionary , when creating a Series.

In [28]:
Ages = {"Shivance" : 25, "dolly" : 45, "Ram" : 35}
Ages

{'Shivance': 25, 'dolly': 45, 'Ram': 35}

In [30]:
pd.Series(Ages) #We can create series with dictionary. The keys of the dictionary become the labels.

Shivance    25
dolly       45
Ram         35
dtype: int64

In Order to select only some of the items in the dictionary , use the index argument and specify only the items you want to include in the series.

In [33]:
pd.Series(Ages,index=["Shivance","dolly"])

Shivance    25
dolly       45
dtype: int64

Creating Pandas Series by Numpy arrays

In [1]:
import numpy as np

In [2]:
a = np.array([10,20,43,44,5,4,77,89])
a

array([10, 20, 43, 44,  5,  4, 77, 89])

In [5]:
pd.Series(a)

0    10
1    20
2    43
3    44
4     5
5     4
6    77
7    89
dtype: int32

Merging 2 different series (Concat)

In [7]:
s1 = pd.Series([1,2,3,45,34,56,45])
s2 = pd.Series([1,23,44,5,4,45,565])

In [8]:
pd.concat([s1,s2])

0      1
1      2
2      3
3     45
4     34
5     56
6     45
0      1
1     23
2     44
3      5
4      4
5     45
6    565
dtype: int64

Selection in pandas Series

In [10]:
s1 = pd.Series([2,34,5,45,334,45])
s1

0      2
1     34
2      5
3     45
4    334
5     45
dtype: int64

In [11]:
s1[3]

45

In [12]:
s1[0:3]

0     2
1    34
2     5
dtype: int64

In [13]:
s1[:4]

0     2
1    34
2     5
3    45
dtype: int64

In [14]:
s1[4:]

4    334
5     45
dtype: int64

In [18]:
s = pd.Series([13,23,14,12,23],index=["firsr","second","third","fourth","fifth"]) # We can also specify string indexes
s

firsr     13
second    23
third     14
fourth    12
fifth     23
dtype: int64

In [17]:
s["third"]

14

In [20]:
s.index #  We can reach indexes of a serie with index attribute

Index(['firsr', 'second', 'third', 'fourth', 'fifth'], dtype='object')

In [22]:
s.keys # We can reach keys (values) of a serie with keys attribute

<bound method Series.keys of firsr     13
second    23
third     14
fourth    12
fifth     23
dtype: int64>

In [24]:
list(s.items()) # We can see values and keys paired with items() function

[('firsr', 13), ('second', 23), ('third', 14), ('fourth', 12), ('fifth', 23)]

Queries in pandas Series

In [26]:
a1 = pd.Series([2,3,45,34,5555,55])
a1

0       2
1       3
2      45
3      34
4    5555
5      55
dtype: int64

In [30]:
1 in a1 # Look if s1 contains 3

True

In [32]:
35 in a1 # Look if a1 contains 34

False

Fancy element Selecting in Pandas

In [33]:
s1 = pd.Series([2,34,45,34,344,])
s1

0      2
1     34
2     45
3     34
4    344
dtype: int64

In [34]:
s1[[2,3]]

2    45
3    34
dtype: int64

In [36]:
s1[[1,4]]

1     34
4    344
dtype: int64

In [39]:
s = pd.Series([12,13,14,15,16,], index=["first","second","third","fourth","fifth"]) # We can also specify string indexes.
s

first     12
second    13
third     14
fourth    15
fifth     16
dtype: int64

In [43]:
s = ["first","second"]
s

['first', 'second']

Updating Values

In [44]:
s1 = pd.Series([2,3,4,56,66,45])
s1

0     2
1     3
2     4
3    56
4    66
5    45
dtype: int64

In [49]:
s1[1] = 315
s1[1]

315

Pandas Dataframes

A DataFrame is a table. It contains an array of individual entries, each of which has a certain value. Each entry corresponds to a row (or record) and a column.

Those who are familiar with R know the data frame as a way to store data in rectangular grids that can easily be overviewed. Each row of these grids corresponds to measurements or values of an instance, while each column is a vector containing data for a specific variable. This means that a data frame’s rows do not need to contain, but can contain, the same type of values: they can be numeric, character, logical, etc.

In [52]:
pd.DataFrame({"Name" : ["Shivance","Ram","Dolly","Choti"], "Age" : [23,56,34,22]}) # IT can be Created directly

       Name  Age
0  Shivance   23
1       Ram   56
2     Dolly   34
3     Choti   22

You can think as columns and values as rows

In [59]:
dic = {"Name" : ["Someshwar","Dolly","Nikhil","Dolly"], "Age" : [14,33,24,23]} # It can be created by external dic
dataframe = pd.DataFrame(dic)
dataframe

        Name  Age
0  Someshwar   14
1      Dolly   33
2     Nikhil   24
3      Dolly   23

In [61]:
dataframe["Age"] # we can access age column with this way

0    14
1    33
2    24
3    23
Name: Age, dtype: int64

In [63]:
dataframe.Age # We can also access age column with this way but it gives error if there is same method as the name as. (column_name)

0    14
1    33
2    24
3    23
Name: Age, dtype: int64

In [68]:
I = [23,24,25,16,222,444,343,44]
df = pd.DataFrame(I,columns=["variable_list"]) # We can create dataframes also with this way 
df # In general , dataframe are named as "df"

   variable_list
0             23
1             24
2             25
3             16
4            222
5            444
6            343
7             44

In [72]:
names = ["Shivance","Gopi","dolly","choti"]
df = pd.DataFrame(names,columns=["Names"])
names
df

      Names
0  Shivance
1      Gopi
2     dolly
3     choti

We can also create dataframe with numpy array

In [73]:
import numpy as np

In [75]:
arr = np.array([3,6,9,34,5,5,3,5,5]).reshape(3,3)
arr

array([[ 3,  6,  9],
       [34,  5,  5],
       [ 3,  5,  5]])

In [77]:
pd.DataFrame(arr,columns=["list_1","list_2","list_3"])

   list_1  list_2  list_3
0       3       6       9
1      34       5       5
2       3       5       5

Attribute of a Dataframe

In [79]:
df = pd.DataFrame(arr,columns=["variable_1","variable_2","variable_3"])
df

   variable_1  variable_2  variable_3
0           3           6           9
1          34           5           5
2           3           5           5

In [82]:
df.axes # It shows names

[RangeIndex(start=0, stop=3, step=1),
 Index(['variable_1', 'variable_2', 'variable_3'], dtype='object')]

In [84]:
df.shape # It shows shape of a dataframe

(3, 3)

In [86]:
df.ndim # It shows dimension of a dataframe

2

In [88]:
df.size # It shows size of a dataframe

9

In [89]:
df.columns

Index(['variable_1', 'variable_2', 'variable_3'], dtype='object')

In [90]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [92]:
df.values # It shows values of a dataframe

array([[ 3,  6,  9],
       [34,  5,  5],
       [ 3,  5,  5]])

Changing Column Names in a Dataframe

In [93]:
df

   variable_1  variable_2  variable_3
0           3           6           9
1          34           5           5
2           3           5           5

In [95]:
df.columns # We can reach columns of a dataframe with this way

Index(['variable_1', 'variable_2', 'variable_3'], dtype='object')

In [98]:
df.columns = ("list1","list2","list3") # We can change columns names of a dataframe with this way
df

   list1  list2  list3
0      3      6      9
1     34      5      5
2      3      5      5

Accessing rows of a dataframe

In [100]:
df = pd.DataFrame({"Name" : ["Shivance","Ram","Dolly","Choti"], "Income" : [23400,2300,23322,50000], "Age" : [25,48,46,52]})
df

       Name  Income  Age
0  Shivance   23400   25
1       Ram    2300   48
2     Dolly   23322   46
3     Choti   50000   52

In Order to reach by their integer location, we can use iloc keyword

In [106]:
df.iloc[0]

Name      Shivance
Income       23400
Age             25
Name: 0, dtype: object

In [107]:
df

       Name  Income  Age
0  Shivance   23400   25
1       Ram    2300   48
2     Dolly   23322   46
3     Choti   50000   52

Fancy Indexing

In [108]:
df.iloc[[0,2]]

       Name  Income  Age
0  Shivance   23400   25
2     Dolly   23322   46

In [115]:
# We also select spesific rows of a column 
df.iloc[[0,3],0]

0    Shivance
3       Choti
Name: Name, dtype: object

In [122]:
df.iloc[[0,3]],[[1,2]]

(       Name  Income  Age
 0  Shivance   23400   25
 3     Choti   50000   52,
 [[1, 2]])

In [123]:
df.iloc[1:3]

    Name  Income  Age
1    Ram    2300   48
2  Dolly   23322   46

In [131]:
df.iloc[1:3,2] # It gets just second column-age

1    48
2    46
Name: Age, dtype: int64

In order to reach by their indexes(labels), we can use loc keyword. If indexes are like 0,1,2..., it can be same as using loc.

In [132]:
df

       Name  Income  Age
0  Shivance   23400   25
1       Ram    2300   48
2     Dolly   23322   46
3     Choti   50000   52

In [142]:
df.loc[1:3]

    Name  Income  Age
1    Ram    2300   48
2  Dolly   23322   46
3  Choti   50000   52

In [145]:
df.loc[[0,2],"Name"] # We can reach spesific columns with name of column

0    Shivance
2       Dolly
Name: Name, dtype: object

In [153]:
df = pd.DataFrame({"Name" : ["Ram","Shivance","Dolly","Choti","Bholu"],"Income" : [11000,5000,4500,7800,9800], "Age" : [35,36,78,25,22]},index=["a","b","c","d","e"])
df

       Name  Income  Age
a       Ram   11000   35
b  Shivance    5000   36
c     Dolly    4500   78
d     Choti    7800   25
e     Bholu    9800   22

In [165]:
df.loc["b"]

Name      Shivance
Income        5000
Age             36
Name: b, dtype: object

In [163]:
# Fancy indexing

In [164]:
df.loc[["a","c"]]

    Name  Income  Age
a    Ram   11000   35
c  Dolly    4500   78

In [166]:
df.loc["b"]

Name      Shivance
Income        5000
Age             36
Name: b, dtype: object

In [168]:
df.loc["c" : ,"Age"] # It gets just income after index c

c    78
d    25
e    22
Name: Age, dtype: int64

In [169]:
df.iloc[0]

Name        Ram
Income    11000
Age          35
Name: a, dtype: object

Accessing columns of a dataframe

In [5]:
df = pd.DataFrame({"Name" : ["Shivance","Dolly","Choti","Ram"], "Income" : [25000,11000,78000,8900], "Age" : [25,36,32,45], "City" : ["Indore","Barwani","Dhar","Mini_Mumbai"]})
df

       Name  Income  Age         City
0  Shivance   25000   25       Indore
1     Dolly   11000   36      Barwani
2     Choti   78000   32         Dhar
3       Ram    8900   45  Mini_Mumbai

In [8]:
df.Age # We can access age column with this way but it gives errror if there is same method as the same name . (column_name)

0    25
1    36
2    32
3    45
Name: Age, dtype: int64

In [9]:
df["Age"] # we

0    25
1    36
2    32
3    45
Name: Age, dtype: int64

In [12]:
df["Age"][3] # We canselect spesific row of a column with this way

45

Assigining a value to spesific row

In [147]:
data = pd.DataFrame({"Name" : ["Someshwar","Dolly","Shivance","Radhika"], "Icome" : [4000,5000,4500,6300], "Age" : [25,78,63,21]})
data

        Name  Icome  Age
0  Someshwar   4000   25
1      Dolly   5000   78
2   Shivance   4500   63
3    Radhika   6300   21

Assigning Custom Indexes

In [173]:
ss = pd.DataFrame({"Name" : ["Shivance","Dolly","Choti","Ram"], "Emp_id" : [202101,202102,202103,202104], "Income" : [7000,8000,8500,6300] , "Age" : [35,45,36,23]})
ss

       Name  Emp_id  Income  Age
0  Shivance  202101    7000   35
1     Dolly  202102    8000   45
2     Choti  202103    8500   36
3       Ram  202104    6300   23

In [174]:
ss

       Name  Emp_id  Income  Age
0  Shivance  202101    7000   35
1     Dolly  202102    8000   45
2     Choti  202103    8500   36
3       Ram  202104    6300   23

In [193]:
Ap = ss.set_index("Emp_id") # We assigned Employee number as index values
Ap

            Name  Income  Age
Emp_id
202101  Shivance    7000   35
202102     Dolly    8000   45
202103     Choti    8500   36
202104       Ram    6300   23

In [196]:
Ap.loc[202101]

Name      Shivance
Income        7000
Age             35
Name: 202101, dtype: object

In [209]:
ds = pd.DataFrame({"Name" : ["Shivance","Preet","Ayushi","Devika"], "Emp_id" : [202101,202102,202103,202104], "Income" : [24000,23000,45000,21000], "Age" : [24,25,34,45] , "City" : ["Mini_Mumbai","Indore","Barwani","Ujjen"]})
ds

       Name  Emp_id  Income  Age         City
0  Shivance  202101   24000   24  Mini_Mumbai
1     Preet  202102   23000   25       Indore
2    Ayushi  202103   45000   34      Barwani
3    Devika  202104   21000   45        Ujjen

In [221]:
#ds.set_index("Emp_id",inplace=True) # Inplace argument assign new indexes directly 
ds.set_index("Name")

          Income  Age         City
Name
Shivance   24000   24  Mini_Mumbai
Preet      23000   25       Indore
Ayushi     45000   34      Barwani
Devika     21000   45        Ujjen

Resetting Indexes

In [223]:
ds

            Name  Income  Age         City
Emp_id
202101  Shivance   24000   24  Mini_Mumbai
202102     Preet   23000   25       Indore
202103    Ayushi   45000   34      Barwani
202104    Devika   21000   45        Ujjen

In [225]:
ds.reset_index(inplace = True)
ds

   index  Emp_id      Name  Income  Age         City
0      0  202101  Shivance   24000   24  Mini_Mumbai
1      1  202102     Preet   23000   25       Indore
2      2  202103    Ayushi   45000   34      Barwani
3      3  202104    Devika   21000   45        Ujjen

In [234]:
Ec = pd.DataFrame({"Name" : ["Shivance","Mannu","Veshnavi","Devika","Ayushi"], "Employee_Num" : [20001,20001,20003,20004,20005], "Income" : [18000,21000,25000,36000,46000], "Age" : [25,34,21,36,31] },index=[31,41,51,11,21])
Ec

        Name  Employee_Num  Income  Age
31  Shivance         20001   18000   25
41     Mannu         20001   21000   34
51  Veshnavi         20003   25000   21
11    Devika         20004   36000   36
21    Ayushi         20005   46000   31

In [235]:
Ec.sort_index(inplace = True)
Ec

        Name  Employee_Num  Income  Age
11    Devika         20004   36000   36
21    Ayushi         20005   46000   31
31  Shivance         20001   18000   25
41     Mannu         20001   21000   34
51  Veshnavi         20003   25000   21

Filtering

In [245]:
Employees = pd.DataFrame({"Name" : ["Shivance","Veshnavi","Devika","Ayushi","Shivani"], "Department" : ["IT", "Finance", "Marketing", "Human Resources", "Operations"], "Income" : [4500,7800,5200,6300,7800], "Age" : [24,25,32,45,22]})
Employees

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

We can check if spesific values satisfy a condition

In [247]:
Employees["Department"] == "Finance"
Employees

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [248]:
Employees["Department"] =="Operations"

0    False
1    False
2    False
3    False
4     True
Name: Department, dtype: bool

WE can get values if condition satisfy.

In [253]:
filt = Employees["Department"] == "IT"
Employees[filt]

       Name Department  Income  Age
0  Shivance         IT    4500   24

In [256]:
Employees[Employees["Department"] == "Operations"]

      Name  Department  Income  Age
4  Shivani  Operations    7800   22

Filtering with Loc gives us flexibility.

In [259]:
Employees.loc[Employees["Department"] == "Finance","Income"]

1    7800
Name: Income, dtype: int64

Filtering with aritmethic operators

In [260]:
Employees

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [262]:
Employees[Employees["Income"]>5500]

       Name       Department  Income  Age
1  Veshnavi          Finance    7800   25
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [263]:
Employees[Employees["Age"]<25]

       Name  Department  Income  Age
0  Shivance          IT    4500   24
4   Shivani  Operations    7800   22

We can use & in order to try 2 condition. This is and logic.

In [266]:
Employees[(Employees["Age"]>21) & (Employees["Income"]>6000)]

       Name       Department  Income  Age
1  Veshnavi          Finance    7800   25
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [267]:
Employees[(Employees["Age"]>25) & (Employees["Income"]>5000)]

     Name       Department  Income  Age
2  Devika        Marketing    5200   32
3  Ayushi  Human Resources    6300   45

In [270]:
Employees[(Employees["Name"]=="Devika") & (Employees["Department"]=="Operations")] # There is no satisfying value.

Empty DataFrame
Columns: [Name, Department, Income, Age]
Index: []

We can Use | in order to try 2 condition . This is or logic.

In [271]:
Employees

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [273]:
Employees[(Employees["Age"] > 30 | (Employees["Income"] > 7000 ))]

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [283]:
Employees[(Employees["Name"]=="Sergio") | (Employees["Department"]=="IT")]

       Name Department  Income  Age
0  Shivance         IT    4500   24

In [285]:
Employees[(Employees["Name"]=="Devika") | (Employees["Department"]=="Operations")]

      Name  Department  Income  Age
2   Devika   Marketing    5200   32
4  Shivani  Operations    7800   22

Opposite Filter

We can get opposite of a filter with ~ (Tilde) sign.

In [287]:
Employees

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [291]:
Employees[~(Employees["Income"]>5000)]

       Name Department  Income  Age
0  Shivance         IT    4500   24

In [293]:
Employees[~(Employees["Age"]<30)]

     Name       Department  Income  Age
2  Devika        Marketing    5200   32
3  Ayushi  Human Resources    6300   45

Filtering with filter() function

In [294]:
Employees

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [13]:
Employees_ss = pd.DataFrame({"Name" : ["Shivance","Veshnavi","Devika","Ayushi","Shivani"], "Department" : ["IT", "Finance", "Marketing", "Human Resources", "Operations"], "Income" : [4500,7800,5200,6300,7800], "Age" : [24,25,32,45,22]})
Employees_ss

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

Filtering with filter() function

In [14]:
Employees_ss

       Name       Department  Income  Age
0  Shivance               IT    4500   24
1  Veshnavi          Finance    7800   25
2    Devika        Marketing    5200   32
3    Ayushi  Human Resources    6300   45
4   Shivani       Operations    7800   22

In [16]:
Employees_ss.filter(items=["Department","Age"])

        Department  Age
0               IT   24
1          Finance   25
2        Marketing   32
3  Human Resources   45
4       Operations   22

In [17]:
Employees_ss.filter(items=["Department","Income"])

        Department  Income
0               IT    4500
1          Finance    7800
2        Marketing    5200
3  Human Resources    6300
4       Operations    7800

Regex is another thema but we can also filter by using regex.

In [18]:
Employees_ss.filter(regex = "e$",axis=1)

       Name  Income  Age
0  Shivance    4500   24
1  Veshnavi    7800   25
2    Devika    5200   32
3    Ayushi    6300   45
4   Shivani    7800   22

Adding / Removing rows and columns

In [20]:
Employees = pd.DataFrame({"Name" : ["Shivance","Shivani","Devika","Vaishnavi","Ayushi"], "Department" : ["HR","Finance","IT","Operations","Marketing"], "Income" : [25000,36000,24000,21000,28000], "Age" : [25,21,32,24,28]})
Employees

        Name  Department  Income  Age
0   Shivance          HR   25000   25
1    Shivani     Finance   36000   21
2     Devika          IT   24000   32
3  Vaishnavi  Operations   21000   24
4     Ayushi   Marketing   28000   28

Adding Rows - append()

In [23]:
Employees.append({"Name" : "Ambika"},ignore_index = True) # It adds automatically to the end of dataframe. But we need to add all values, otherwise it gives nan.

C:\Users\hp\AppData\Local\Temp\ipykernel_3388\1132755570.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  Employees.append({"Name" : "Ambika"},ignore_index = True) # It adds automatically to the end of dataframe. But we need to add all values, otherwise it gives nan.

        Name  Department   Income   Age
0   Shivance          HR  25000.0  25.0
1    Shivani     Finance  36000.0  21.0
2     Devika          IT  24000.0  32.0
3  Vaishnavi  Operations  21000.0  24.0
4     Ayushi   Marketing  28000.0  28.0
5     Ambika         NaN      NaN   NaN

In [24]:
Employees.append({"Name" : "Ambika","Department":"Supply Chain","Income":35000,"Age":26},ignore_index=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_3388\2518320941.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  Employees.append({"Name" : "Ambika","Department":"Supply Chain","Income":35000,"Age":26},ignore_index=True)

        Name    Department  Income  Age
0   Shivance            HR   25000   25
1    Shivani       Finance   36000   21
2     Devika            IT   24000   32
3  Vaishnavi    Operations   21000   24
4     Ayushi     Marketing   28000   28
5     Ambika  Supply Chain   35000   26

Removing Rows

We can remove by index.

In [25]:
Employees.drop(index=3)

       Name Department  Income  Age
0  Shivance         HR   25000   25
1   Shivani    Finance   36000   21
2    Devika         IT   24000   32
4    Ayushi  Marketing   28000   28

We can remove by conditions.

In [27]:
Employees[Employees["Age"]<30]

        Name  Department  Income  Age
0   Shivance          HR   25000   25
1    Shivani     Finance   36000   21
3  Vaishnavi  Operations   21000   24
4     Ayushi   Marketing   28000   28

In [28]:
Employees.drop(index=Employees[Employees["Age"]>30].index)

        Name  Department  Income  Age
0   Shivance          HR   25000   25
1    Shivani     Finance   36000   21
3  Vaishnavi  Operations   21000   24
4     Ayushi   Marketing   28000   28

Adding Columns

In [31]:
Employees["Experience"] = [5,6,3,4,7]
Employees

        Name  Department  Income  Age  Experience
0   Shivance          HR   25000   25           5
1    Shivani     Finance   36000   21           6
2     Devika          IT   24000   32           3
3  Vaishnavi  Operations   21000   24           4
4     Ayushi   Marketing   28000   28           7

Removing Columns

In [32]:
Employees.drop(columns=["Experience","Income"])

        Name  Department  Age
0   Shivance          HR   25
1    Shivani     Finance   21
2     Devika          IT   32
3  Vaishnavi  Operations   24
4     Ayushi   Marketing   28

In [33]:
Employees.drop(["Experience","Income"],axis=1) #Axis 1 means columns

        Name  Department  Age
0   Shivance          HR   25
1    Shivani     Finance   21
2     Devika          IT   32
3  Vaishnavi  Operations   24
4     Ayushi   Marketing   28

In [34]:
# Fancy indexing gives same result

In [35]:
Employees[["Name","Department","Age"]]

        Name  Department  Age
0   Shivance          HR   25
1    Shivani     Finance   21
2     Devika          IT   32
3  Vaishnavi  Operations   24
4     Ayushi   Marketing   28

Merging DataFrames

Concat() function

In [38]:
Employees = pd.DataFrame({"Name" : ["Devika","Shivani","Vaishnavi","Ambika","Ayushi"], "Department" : ["IT","HR","Marketing","Finance","Supply Chain"], "Income" : [23000,21000,34000,25000,41000], "Age" : [23,45,32,54,21]})
Employees

        Name    Department  Income  Age
0     Devika            IT   23000   23
1    Shivani            HR   21000   45
2  Vaishnavi     Marketing   34000   32
3     Ambika       Finance   25000   54
4     Ayushi  Supply Chain   41000   21

In [40]:
Employees2 = pd.DataFrame({"Name" : ["Divya","Avani","Shivansh","Drashti","Ashvini"], "Department" : ["Docter","Lower","Finance","CA","Team Leader"], "Income" : [25000,35000,32000,15000,150000]})
Employees2

       Name   Department  Income
0     Divya       Docter   25000
1     Avani        Lower   35000
2  Shivansh      Finance   32000
3   Drashti           CA   15000
4   Ashvini  Team Leader  150000

In [53]:
Employees2["Age"] = [25,36,45,63,25]
Employees_2 = Employees2
Employees_2

       Name   Department  Income  Age
0     Divya       Docter   25000   25
1     Avani        Lower   35000   36
2  Shivansh      Finance   32000   45
3   Drashti           CA   15000   63
4   Ashvini  Team Leader  150000   25

We can merge dataframe with concat(0) function.

In [54]:
pd.concat([Employees_1,Employees_2]) # It will merge with out changing indexes

        Name    Department  Income  Age
0     Devika            IT   23000   25
1    Shivani            HR   21000   36
2  Vaishnavi     Marketing   34000   45
3     Ambika       Finance   25000   63
4     Ayushi  Supply Chain   41000   25
0      Divya        Docter   25000   25
1      Avani         Lower   35000   36
2   Shivansh       Finance   32000   45
3    Drashti            CA   15000   63
4    Ashvini   Team Leader  150000   25

In [55]:
pd.concat([Employees_1,Employees2], ignore_index = True) # It will update indexes

        Name    Department  Income  Age
0     Devika            IT   23000   25
1    Shivani            HR   21000   36
2  Vaishnavi     Marketing   34000   45
3     Ambika       Finance   25000   63
4     Ayushi  Supply Chain   41000   25
5      Divya        Docter   25000   25
6      Avani         Lower   35000   36
7   Shivansh       Finance   32000   45
8    Drashti            CA   15000   63
9    Ashvini   Team Leader  150000   25

Joins

Join is a common concept coming from SQL. it helps us merging dataframes.

Inner Join

An inner join requires each row in the two joined dataframes to have matching column values. This is similar to the intersection of two sets

In [57]:
class1 = pd.DataFrame({"Name" : ["Radhika","Shivi","Ashu","Choti"], "Student Number" : [202221,202222,202223,202224], "GPA" : [3.40,5.32,4.53,6.12]})
class1

      Name  Student Number   GPA
0  Radhika          202221  3.40
1    Shivi          202222  5.32
2     Ashu          202223  4.53
3    Choti          202224  6.12

In [60]:
class2 = pd.DataFrame({"Name" : ["Krishna","Kartik","Ram","Dolly"], "Student Number" : [202225,202226,202227,202228], "Age" : [18,15,12,13]})
class2

      Name  Student Number  Age
0  Krishna          202225   18
1   Kartik          202226   15
2      Ram          202227   12
3    Dolly          202228   13

In [62]:
pd.concat([class1,class2]) # Every column is not sanme

      Name  Student Number   GPA   Age
0  Radhika          202221  3.40   NaN
1    Shivi          202222  5.32   NaN
2     Ashu          202223  4.53   NaN
3    Choti          202224  6.12   NaN
0  Krishna          202225   NaN  18.0
1   Kartik          202226   NaN  15.0
2      Ram          202227   NaN  12.0
3    Dolly          202228   NaN  13.0

In [64]:
pd.concat([class1,class2],join = "inner") # Inner join just gets intersection of dataframes

      Name  Student Number
0  Radhika          202221
1    Shivi          202222
2     Ashu          202223
3    Choti          202224
0  Krishna          202225
1   Kartik          202226
2      Ram          202227
3    Dolly          202228

Full Join (Full Outer Join)

Full Join, also knownas full outer join,returns all those records which either have a match in the left or right dataframe.

In [68]:
pd.concat([class1,class2], join="outer") # Full outer join just gets all of dataframes

      Name  Student Number   GPA   Age
0  Radhika          202221  3.40   NaN
1    Shivi          202222  5.32   NaN
2     Ashu          202223  4.53   NaN
3    Choti          202224  6.12   NaN
0  Krishna          202225   NaN  18.0
1   Kartik          202226   NaN  15.0
2      Ram          202227   NaN  12.0
3    Dolly          202228   NaN  13.0

Left join, also known as Left Join , returns a dataframe containing all the rows of the left dataframe.In order to do that, we use merge() function

In [70]:
pd.merge(class1,class2,how="left") # Left join just gets all of rows of the left dataframe

      Name  Student Number   GPA  Age
0  Radhika          202221  3.40  NaN
1    Shivi          202222  5.32  NaN
2     Ashu          202223  4.53  NaN
3    Choti          202224  6.12  NaN

Right Join (Right Outer Join)

Right join, also known as Right Outer Join, is similar to the Left Outer Join. The Only difference is that all the rows of the right dataframe are taken as it is and only those of the left dataframe that are common in both.

In [71]:
pd.merge(class1,class2,how="right") # Right join just gets all of rows of the right dataframe

      Name  Student Number  GPA  Age
0  Krishna          202225  NaN   18
1   Kartik          202226  NaN   15
2      Ram          202227  NaN   12
3    Dolly          202228  NaN   13

We can also merge dataframes with many to many structure.

In [73]:
class1 = pd.DataFrame({"Name" : ["Krishnkant","Rameshwar","Mojilal","Rajesh","Devanand"], "Student Number" : [20001,20002,20003,20004,20005], "Department" : ["Informatics","Computer","Management","Marketing","Lawer"]})
class1

         Name  Student Number   Department
0  Krishnkant           20001  Informatics
1   Rameshwar           20002     Computer
2     Mojilal           20003   Management
3      Rajesh           20004    Marketing
4    Devanand           20005        Lawer

In [77]:
lectures = pd.DataFrame({"Department" : ["Informatics","Computer Science","Management","Low","Histry","Politics","Management","Histry"], "Lectures" : ["MIS","Linear Algebra","Introduction to Finance","Data Mining","IT project Management","Marketing 101","Data Science","Business Analytics"]})
lectures

         Department                 Lectures
0       Informatics                      MIS
1  Computer Science           Linear Algebra
2        Management  Introduction to Finance
3               Low              Data Mining
4            Histry    IT project Management
5          Politics            Marketing 101
6        Management             Data Science
7            Histry       Business Analytics

In [78]:
pd.merge(class1,lectures)

         Name  Student Number   Department                 Lectures
0  Krishnkant           20001  Informatics                      MIS
1     Mojilal           20003   Management  Introduction to Finance
2     Mojilal           20003   Management             Data Science

Append()

We can also merge dataframes with append() function.

In [79]:
Employees.append(Employees_2,ignore_index = True)

C:\Users\hp\AppData\Local\Temp\ipykernel_3388\639926942.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  Employees.append(Employees_2,ignore_index = True)

        Name    Department  Income  Age
0     Devika            IT   23000   25
1    Shivani            HR   21000   36
2  Vaishnavi     Marketing   34000   45
3     Ambika       Finance   25000   63
4     Ayushi  Supply Chain   41000   25
5      Divya        Docter   25000   25
6      Avani         Lower   35000   36
7   Shivansh       Finance   32000   45
8    Drashti            CA   15000   63
9    Ashvini   Team Leader  150000   25

Sorting

In [81]:
Employees = pd.DataFrame({"Name" : ["Ambika","Devika","Shivansh","Devika","Shivani"], "Department" : ["IT","HR","Supply Chain","Finance","Marketing"], "Income" : [5000,5050,6500,5400,9800], "Age" : [23,45,25,32,25]})
Employees

       Name    Department  Income  Age
0    Ambika            IT    5000   23
1    Devika            HR    5050   45
2  Shivansh  Supply Chain    6500   25
3    Devika       Finance    5400   32
4   Shivani     Marketing    9800   25

In [83]:
Employees.sort_values(by="Age") # We sort it by age column

       Name    Department  Income  Age
0    Ambika            IT    5000   23
2  Shivansh  Supply Chain    6500   25
4   Shivani     Marketing    9800   25
3    Devika       Finance    5400   32
1    Devika            HR    5050   45

In [86]:
Employees.sort_values(by = "Age",ascending=False) # WE sortit by decending age

       Name    Department  Income  Age
1    Devika            HR    5050   45
3    Devika       Finance    5400   32
2  Shivansh  Supply Chain    6500   25
4   Shivani     Marketing    9800   25
0    Ambika            IT    5000   23

In [88]:
Employees.sort_values(by=["Name","Income"]) # It will first sort by name and then it will compare income column

       Name    Department  Income  Age
0    Ambika            IT    5000   23
1    Devika            HR    5050   45
3    Devika       Finance    5400   32
4   Shivani     Marketing    9800   25
2  Shivansh  Supply Chain    6500   25

In [90]:
Employees.sort_values(by=["Name","Age"],ascending=[True,False])

       Name    Department  Income  Age
0    Ambika            IT    5000   23
1    Devika            HR    5050   45
3    Devika       Finance    5400   32
4   Shivani     Marketing    9800   25
2  Shivansh  Supply Chain    6500   25

In order to get largest elements in a column, we can use nlargest() function.

In [92]:
Employees["Income"].nlargest(3)

4    9800
2    6500
3    5400
Name: Income, dtype: int64

In order to get smallest elements in a column, we can use nsmallest() function.

In [98]:
Employees["Income"].nsmallest(2)

0    5000
1    5050
Name: Income, dtype: int64

In [ ]:
Aggregation Function

Pandas has a number of aggregating functions that reduce the dimension of the grouped object.

Common Aggregation Functions

count()
value_count()
mean()
median()
sum()
min()
max()
std()
var()
describe()
sem()

In [6]:
Employees = pd.DataFrame({"Name" : ["Shivance","Devika","Shivani","Choti","Dolly","Ayushi","Nikhil","Krishna","Vaishnavi"], "Department" : ["IT","Finance","HR","Marketing","Supply Chain","Finance","HR","Operations","Finance"], "Income" : [8000,10000,11000,4500,6700,9850,5600,6500,8900], "Age" : [24,45,34,36,23,45,25,26,33], "Experience" : [2,3,6,2,1,6,3,5,7]})
Employees

        Name    Department  Income  Age  Experience
0   Shivance            IT    8000   24           2
1     Devika       Finance   10000   45           3
2    Shivani            HR   11000   34           6
3      Choti     Marketing    4500   36           2
4      Dolly  Supply Chain    6700   23           1
5     Ayushi       Finance    9850   45           6
6     Nikhil            HR    5600   25           3
7    Krishna    Operations    6500   26           5
8  Vaishnavi       Finance    8900   33           7

In [8]:
Employees.count() # IT count elements by columns

Name          9
Department    9
Income        9
Age           9
Experience    9
dtype: int64

In [10]:
Employees["Department"].value_counts() # It count values in a column. It just work with series !

Finance         3
HR              2
IT              1
Marketing       1
Supply Chain    1
Operations      1
Name: Department, dtype: int64

In [12]:
Employees.mean() # Compute mean of each column if it's numeric

C:\Users\hp\AppData\Local\Temp\ipykernel_6828\1347365648.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Employees.mean() # Compute mean of each column if it's numeric

Income        7894.444444
Age             32.333333
Experience       3.888889
dtype: float64

In [14]:
Employees["Income"].mean() # We can also compute mean of a spesific column

7894.444444444444

In [15]:
Employees.median()

C:\Users\hp\AppData\Local\Temp\ipykernel_6828\3024986245.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Employees.median()

Income        8000.0
Age             33.0
Experience       3.0
dtype: float64

In [17]:
Employees["Income"].median() # We can also compute median of a spesific column

8000.0

In [18]:
Employees.sum()

Name          ShivanceDevikaShivaniChotiDollyAyushiNikhilKri...
Department    ITFinanceHRMarketingSupply ChainFinanceHROpera...
Income                                                    71050
Age                                                         291
Experience                                                   35
dtype: object

In [20]:
Employees["Income"].sum() # We can also compute sum of a spesific column

71050

In [22]:
Employees.min() # Compute minimum value of each column

Name           Ayushi
Department    Finance
Income           4500
Age                23
Experience          1
dtype: object

In [24]:
Employees["Age"].min() # We can also compute minimum value of a spesific column

23

In [26]:
Employees.max() # Compute maximum value of each column

Name             Vaishnavi
Department    Supply Chain
Income               11000
Age                     45
Experience               7
dtype: object

In [27]:
Employees["Age"].max()

45

In [28]:
Employees.std() # Compute standard deviation of each column if it's numeric

C:\Users\hp\AppData\Local\Temp\ipykernel_6828\2648013210.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Employees.std() # Compute standard deviation of each column if it's numeric

Income        2210.266449
Age              8.573214
Experience       2.147350
dtype: float64

In [30]:
Employees["Age"].std() # We can also compute standard deviation of a spesific column

8.573214099741124

In [32]:
Employees.var() # Compute variance of each column if it's numeric

C:\Users\hp\AppData\Local\Temp\ipykernel_6828\316363625.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Employees.var() # Compute variance of each column if it's numeric

Income        4.885278e+06
Age           7.350000e+01
Experience    4.611111e+00
dtype: float64

In [34]:
Employees["Age"].var() # We can also compute variance of a spesific column

73.50000000000001

In [36]:
Employees.describe() # It computes a quick summary of values per group if it's numeric.

             Income        Age  Experience
count      9.000000   9.000000    9.000000
mean    7894.444444  32.333333    3.888889
std     2210.266449   8.573214    2.147350
min     4500.000000  23.000000    1.000000
25%     6500.000000  25.000000    2.000000
50%     8000.000000  33.000000    3.000000
75%     9850.000000  36.000000    6.000000
max    11000.000000  45.000000    7.000000

In [39]:
Employees.describe().T #We can also see transpoze of it to see better.

,count,mean,std,min,25%,50%,75%,max
Income,9.0,7894.444444,2210.266449,4500.0,6500.0,8000.0,9850.0,11000.0
Age,9.0,32.333333,8.573214,23.0,25.0,33.0,36.0,45.0
Experience,9.0,3.888889,2.147350,1.0,2.0,3.0,6.0,7.0

In [40]:
Employees.sem()

C:\Users\hp\AppData\Local\Temp\ipykernel_6828\3548582179.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Employees.sem()

Income        736.755483
Age             2.857738
Experience      0.715783
dtype: float64

Grouping

Any groupby operation one of the following operations on the original object. They are;

1) Splitting the Object
2) Applying a function
3) Combining the results

Value which is used for grouping must be categorical variable.

In [3]:
Employees = pd.DataFrame({"Name" : ["Shivance","Radhika","Ambika","Vaishnavi","Shivani","Krishna","Choti","Dolly","Ram"], "Department" : ["HR","Finance","Marketing","Operations","Data Analytics","Marketing","Finance","Supply Chain","Data Analytics"], "Income" : [8000,12000,4500,6600,7800,6900,7800,3500,25000], "Age" : [21,34,23,21,26,45,25,26,53], "Experience" : [2,4,1,5,7,4,6,3,5]})
Employees

        Name      Department  Income  Age  Experience
0   Shivance              HR    8000   21           2
1    Radhika         Finance   12000   34           4
2     Ambika       Marketing    4500   23           1
3  Vaishnavi      Operations    6600   21           5
4    Shivani  Data Analytics    7800   26           7
5    Krishna       Marketing    6900   45           4
6      Choti         Finance    7800   25           6
7      Dolly    Supply Chain    3500   26           3
8        Ram  Data Analytics   25000   53           5

Departments are categorical variables and we can to group employees by their department. In order to do that, we use groupby() function.

In [43]:
Employees.groupby("Department") # IT will create an object

In [46]:
Employees_Department = Employees.groupby("Department")
Employees_Department.get_group("Finance")

      Name Department  Income  Age  Experience
1  Radhika    Finance   12000   34           4
6    Choti    Finance    7800   25           6

We Can also do that with filtering.

In [50]:
Employees[Employees["Department"]=="Marketing"]

      Name Department  Income  Age  Experience
2   Ambika  Marketing    4500   23           1
5  Krishna  Marketing    6900   45           4

In [52]:
Employees.groupby("Department").mean() # We can get mean of every department.

                 Income   Age  Experience
Department
Data Analytics  16400.0  39.5         6.0
Finance          9900.0  29.5         5.0
HR               8000.0  21.0         2.0
Marketing        5700.0  34.0         2.5
Operations       6600.0  21.0         5.0
Supply Chain     3500.0  26.0         3.0

In [53]:
Employees.groupby("Department")["Experience"].sum()

Department
Data Analytics    12
Finance           10
HR                 2
Marketing          5
Operations         5
Supply Chain       3
Name: Experience, dtype: int64

In [55]:
Employees.groupby("Department").mean()["Age"] # Mean of age by each department

Department
Data Analytics    39.5
Finance           29.5
HR                21.0
Marketing         34.0
Operations        21.0
Supply Chain      26.0
Name: Age, dtype: float64

In [56]:
Employees.groupby("Department")["Age"].describe() # We also can see with describe

                count  mean        std   min    25%   50%    75%   max
Department
Data Analytics    2.0  39.5  19.091883  26.0  32.75  39.5  46.25  53.0
Finance           2.0  29.5   6.363961  25.0  27.25  29.5  31.75  34.0
HR                1.0  21.0        NaN  21.0  21.00  21.0  21.00  21.0
Marketing         2.0  34.0  15.556349  23.0  28.50  34.0  39.50  45.0
Operations        1.0  21.0        NaN  21.0  21.00  21.0  21.00  21.0
Supply Chain      1.0  26.0        NaN  26.0  26.00  26.0  26.00  26.0

If we want to apply more than 1 function, we need to use agg(). It is same as aggregate().

In [58]:
Employees.groupby("Department")["Income"].agg(["mean","max","median"]) # We get mean, max and median of Income in each department.

                   mean    max   median
Department
Data Analytics  16400.0  25000  16400.0
Finance          9900.0  12000   9900.0
HR               8000.0   8000   8000.0
Marketing        5700.0   6900   5700.0
Operations       6600.0   6600   6600.0
Supply Chain     3500.0   3500   3500.0

In [60]:
Employees.groupby("Department")["Income"].agg(["mean","max","median"]).loc ["Finance"] #We get mean, max and median of Income in Finance department.

mean       9900.0
max       12000.0
median     9900.0
Name: Finance, dtype: float64

In [5]:
Employees.groupby("Department").aggregate({"max","min"}) # WE get max and min value in each department.

                     Name            Income       Age     Experience
                      max        min    max   min max min        max min
Department
Data Analytics    Shivani        Ram  25000  7800  53  26          7   5
Finance           Radhika      Choti  12000  7800  34  25          6   4
HR               Shivance   Shivance   8000  8000  21  21          2   2
Marketing         Krishna     Ambika   6900  4500  45  23          4   1
Operations      Vaishnavi  Vaishnavi   6600  6600  21  21          5   5
Supply Chain        Dolly      Dolly   3500  3500  26  26          3   3

In [6]:
Employees.groupby("Department").aggregate({"Income" : "mean","Age" : "max"})

                 Income  Age
Department
Data Analytics  16400.0   53
Finance          9900.0   34
HR               8000.0   21
Marketing        5700.0   45
Operations       6600.0   21
Supply Chain     3500.0   26

transform() operation

Pandas DataFrame.transform() function call func on self producing a DataFrame with transformed values and that has the same axis length as self.

The first argument func is to specify the function to be used for manipulating data. It can be a function, a string function name, a list of functions, or a dictionary of axis label.

The second argument axis is to specify which axis the func is applied to. 0 for applying the func to each column and 1 for applying the func to each row.

Let's say we want to make a 1000$ salary increase to each employee. First, we define a function that increase the salaries.

In [8]:
def salary_increase(x):
    return x+800

In [10]:
Employees["Income"] # Current salaries

0     8000
1    12000
2     4500
3     6600
4     7800
5     6900
6     7800
7     3500
8    25000
Name: Income, dtype: int64

In [11]:
Employees["Income"].transform(salary_increase)

0     8800
1    12800
2     5300
3     7400
4     8600
5     7700
6     8600
7     4300
8    25800
Name: Income, dtype: int64

We can use lambda for shorter way. it's a functional programming logic.

In [16]:
Employees["Income"].transform(lambda x: x+1100)

0     9100
1    13100
2     5600
3     7700
4     8900
5     8000
6     8900
7     4600
8    26100
Name: Income, dtype: int64

In [18]:
Employees["Income"].transform(lambda x : (x-x.mean()/x.std())) # Standartizing

0     7998.578413
1    11998.578413
2     4498.578413
3     6598.578413
4     7798.578413
5     6898.578413
6     7798.578413
7     3498.578413
8    24998.578413
Name: Income, dtype: float64

In [20]:
Employees[["Income","Age"]].transform("sqrt") # We can also apply a string function.

       Income       Age
0   89.442719  4.582576
1  109.544512  5.830952
2   67.082039  4.795832
3   81.240384  4.582576
4   88.317609  5.099020
5   83.066239  6.708204
6   88.317609  5.000000
7   59.160798  5.099020
8  158.113883  7.280110

Apply

It applies a spesific function all values of a dataframe of serie.

In [25]:
Employees = pd.DataFrame({"Name" : ["Shivance","Shivam","Radhika","Devika","Shivani","Veshnavi","Ayushi","Krishna","Devika"], "Department" : ["IT","HR","Finance","Operations","Marketing","Supply chain","Finance","Data Analytics","Finance"],"Income" : [12000,32000,4500,6700,24332,3533,8900,45600,21000], "Age" : [25,56,32,45,25,21,36,21,32] ,"Experience" : [2,3,6,2,1,4,5,3,5]})
Employees

       Name      Department  Income  Age  Experience
0  Shivance              IT   12000   25           2
1    Shivam              HR   32000   56           3
2   Radhika         Finance    4500   32           6
3    Devika      Operations    6700   45           2
4   Shivani       Marketing   24332   25           1
5  Veshnavi    Supply chain    3533   21           4
6    Ayushi         Finance    8900   36           5
7   Krishna  Data Analytics   45600   21           3
8    Devika         Finance   21000   32           5

In [27]:
Employees["Name"].apply(len) # We get length of all names

0    8
1    6
2    7
3    6
4    7
5    8
6    6
7    7
8    6
Name: Name, dtype: int64

In [28]:
def increase_age(x):
    return x+1

In [29]:
Employees["Age"].apply(increase_age) # We increase each age.

0    26
1    57
2    33
3    46
4    26
5    22
6    37
7    22
8    33
Name: Age, dtype: int64

In [33]:
Employees["Age"].apply(lambda x: x+2+1) # We increase each age.

0    28
1    59
2    35
3    48
4    28
5    24
6    39
7    24
8    35
Name: Age, dtype: int64

In [36]:
import numpy as np

In [37]:
Employees.apply(np.sum)

Name          ShivanceShivamRadhikaDevikaShivaniVeshnaviAyus...
Department    ITHRFinanceOperationsMarketingSupply chainFina...
Income                                                   158565
Age                                                         293
Experience                                                   31
dtype: object

In [38]:
Employees.groupby("Department")["Income"].apply(np.sum) # We

Department
Data Analytics    45600
Finance           34400
HR                32000
IT                12000
Marketing         24332
Operations         6700
Supply chain       3533
Name: Income, dtype: int64

In [40]:
Employees.groupby("Department")["Age"].apply(min) # We get smallest age by each department.

Department
Data Analytics    21
Finance           32
HR                56
IT                25
Marketing         25
Operations        45
Supply chain      21
Name: Age, dtype: int64

In [41]:
Employees.loc[: , ["Income","Age"]].apply(["max","min"])

     Income  Age
max   45600   56
min    3533   21

We can also use applymap() function in order to apply a function to a DataFrame elementwise.

In [42]:
Employees

       Name      Department  Income  Age  Experience
0  Shivance              IT   12000   25           2
1    Shivam              HR   32000   56           3
2   Radhika         Finance    4500   32           6
3    Devika      Operations    6700   45           2
4   Shivani       Marketing   24332   25           1
5  Veshnavi    Supply chain    3533   21           4
6    Ayushi         Finance    8900   36           5
7   Krishna  Data Analytics   45600   21           3
8    Devika         Finance   21000   32           5

In [43]:
Employees[["Name","Department"]].applymap(len)

   Name  Department
0     8           2
1     6           2
2     7           7
3     6          10
4     7           9
5     8          12
6     6           7
7     7          14
8     6           7

In [45]:
Employees[["Name"]].applymap(str.upper) # WE get upper value of each name.

       Name
0  SHIVANCE
1    SHIVAM
2   RADHIKA
3    DEVIKA
4   SHIVANI
5  VESHNAVI
6    AYUSHI
7   KRISHNA
8    DEVIKA

We can use map() function in order to map value of Series according to input correspondence.

In [47]:
Employees["Department"].map({"Finance" : "Information Technology"})

0                       NaN
1                       NaN
2    Information Technology
3                       NaN
4                       NaN
5                       NaN
6    Information Technology
7                       NaN
8    Information Technology
Name: Department, dtype: object

But it also looks other values. In order to apply that just to IT, we will use replace() method.

In [48]:
Employees

       Name      Department  Income  Age  Experience
0  Shivance              IT   12000   25           2
1    Shivam              HR   32000   56           3
2   Radhika         Finance    4500   32           6
3    Devika      Operations    6700   45           2
4   Shivani       Marketing   24332   25           1
5  Veshnavi    Supply chain    3533   21           4
6    Ayushi         Finance    8900   36           5
7   Krishna  Data Analytics   45600   21           3
8    Devika         Finance   21000   32           5

Pivot Tables

It creates a spreadsheet-style pivot table as a DataFrame.

The levels in the pivot table will be stored in Multindex objects (hierachical indexes) on the index and columns of the result DataFrame.

In [105]:
Employees = pd.DataFrame({"Name" : ["Shivance","Devika","Veshnavi","Shivani","Krishna","Devika","Krishna","Ambika","Drashti"], "Department" : ["HR","Finance","Marketing","Data Analytics","Finace","Operations","Finance","Supply Chain","Data Analytics"], "Work Level" : ["WL1","WL3","WL2","WL5","WL4","WL6","WL9","WL8","WL7"], "Income" : [45000,5600,7800,9800,23000,5200,6500,78900,6500], "Age" : [21,32,25,45,36,25,23,65,45], "Experince" : [2,5,"none",7,"none",3,4,6,5]})
Employees

       Name      Department Work Level  Income  Age Experince
0  Shivance              HR        WL1   45000   21         2
1    Devika         Finance        WL3    5600   32         5
2  Veshnavi       Marketing        WL2    7800   25      none
3   Shivani  Data Analytics        WL5    9800   45         7
4   Krishna          Finace        WL4   23000   36      none
5    Devika      Operations        WL6    5200   25         3
6   Krishna         Finance        WL9    6500   23         4
7    Ambika    Supply Chain        WL8   78900   65         6
8   Drashti  Data Analytics        WL7    6500   45         5

In [52]:
Employees.head()

       Name      Department Work Level  Income  Age  Experince
0  Shivance              HR        WL1   45000   21          2
1    Devika         Finance        WL3    5600   32          5
2  Veshnavi       Marketing        WL2    7800   25          9
3   Shivani  Data Analytics        WL5    9800   45          7
4   Krishna          Finace        WL4   23000   36          1

In [53]:
Employees.groupby("Department")["Income"].mean()

Department
Data Analytics     8150.0
Finace            23000.0
Finance            6050.0
HR                45000.0
Marketing          7800.0
Operations         5200.0
Supply Chain      78900.0
Name: Income, dtype: float64

In [55]:
Employees.groupby(["Department","Work Level"])[["Income"]].agg("mean") 
# We get mean of income according to department and work level. We see no nan values here , because it does not get na values.

                            Income
Department     Work Level
Data Analytics WL5          9800.0
               WL7          6500.0
Finace         WL4         23000.0
Finance        WL3          5600.0
               WL9          6500.0
HR             WL1         45000.0
Marketing      WL2          7800.0
Operations     WL6          5200.0
Supply Chain   WL8         78900.0

In [57]:
Employees.groupby(["Department","Work Level"])[["Income"]].agg("mean").unstack()
# We get mean of income according to department and work level. Unstack() helps to see better.

                 Income                                                   \
Work Level          WL1     WL2     WL3      WL4     WL5     WL6     WL7
Department
Data Analytics      NaN     NaN     NaN      NaN  9800.0     NaN  6500.0
Finace              NaN     NaN     NaN  23000.0     NaN     NaN     NaN
Finance             NaN     NaN  5600.0      NaN     NaN     NaN     NaN
HR              45000.0     NaN     NaN      NaN     NaN     NaN     NaN
Marketing           NaN  7800.0     NaN      NaN     NaN     NaN     NaN
Operations          NaN     NaN     NaN      NaN     NaN  5200.0     NaN
Supply Chain        NaN     NaN     NaN      NaN     NaN     NaN     NaN


Work Level          WL8     WL9
Department
Data Analytics      NaN     NaN
Finace              NaN     NaN
Finance             NaN  6500.0
HR                  NaN     NaN
Marketing           NaN     NaN
Operations          NaN     NaN
Supply Chain    78900.0     NaN

In [58]:
Employees.pivot_table("Income",index="Department",columns="Work Level") # We can make it easier .

Work Level,WL1,WL2,WL3,WL4,WL5,WL6,WL7,WL8,WL9
Department,,,,,,,,,
Data Analytics,NaN,NaN,NaN,NaN,9800.0,NaN,6500.0,NaN,NaN
Finace,NaN,NaN,NaN,23000.0,NaN,NaN,NaN,NaN,NaN
Finance,NaN,NaN,5600.0,NaN,NaN,NaN,NaN,NaN,6500.0
HR,45000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marketing,NaN,7800.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Operations,NaN,NaN,NaN,NaN,NaN,5200.0,NaN,NaN,NaN
Supply Chain,NaN,NaN,NaN,NaN,NaN,NaN,NaN,78900.0,NaN

In [62]:
Employees

       Name      Department Work Level  Income  Age  Experince
0  Shivance              HR        WL1   45000   21          2
1    Devika         Finance        WL3    5600   32          5
2  Veshnavi       Marketing        WL2    7800   25          9
3   Shivani  Data Analytics        WL5    9800   45          7
4   Krishna          Finace        WL4   23000   36          1
5    Devika      Operations        WL6    5200   25          3
6   Krishna         Finance        WL9    6500   23          4
7    Ambika    Supply Chain        WL8   78900   65          6
8   Drashti  Data Analytics        WL7    6500   45          5

In [68]:
Exp = pd.cut(Employees["Experince"],[0,5,6,7,9])
Exp

0    (0, 5]
1    (0, 5]
2    (7, 9]
3    (6, 7]
4    (0, 5]
5    (0, 5]
6    (0, 5]
7    (5, 6]
8    (0, 5]
Name: Experince, dtype: category
Categories (4, interval[int64, right]): [(0, 5] < (5, 6] < (6, 7] < (7, 9]]

In [71]:
Employees.pivot_table("Income",index=["Department",Exp],columns="Work Level") # We can make it easier.

Work Level                    WL1     WL2     WL3      WL4     WL5     WL6  \
Department     Experince
Data Analytics (0, 5]         NaN     NaN     NaN      NaN     NaN     NaN
               (6, 7]         NaN     NaN     NaN      NaN  9800.0     NaN
Finace         (0, 5]         NaN     NaN     NaN  23000.0     NaN     NaN
Finance        (0, 5]         NaN     NaN  5600.0      NaN     NaN     NaN
HR             (0, 5]     45000.0     NaN     NaN      NaN     NaN     NaN
Marketing      (7, 9]         NaN  7800.0     NaN      NaN     NaN     NaN
Operations     (0, 5]         NaN     NaN     NaN      NaN     NaN  5200.0
Supply Chain   (5, 6]         NaN     NaN     NaN      NaN     NaN     NaN

Work Level                   WL7      WL8     WL9
Department     Experince
Data Analytics (0, 5]     6500.0      NaN     NaN
               (6, 7]        NaN      NaN     NaN
Finace         (0, 5]        NaN      NaN     NaN
Finance        (0, 5]        NaN      NaN  6500.0
HR             (0, 5]        NaN      NaN     NaN
Marketing      (7, 9]        NaN      NaN     NaN
Operations     (0, 5]        NaN      NaN     NaN
Supply Chain   (5, 6]        NaN  78900.0     NaN

MISSING Values (NaN)

In [81]:
import numpy as np

In [83]:
Employees = pd.DataFrame({"Name" : ["Shivance","Devika","Ayushi","Punit","Krishna","Radhika","Shivani","Veshnavi","Ambika"], "Department" : ["IT","HR","Finance","Marketing","Finance","Marketing","Supply Chain","HR","Data Analytics"], "Work Level" : ["WL1","WL3","WL2","WL5","WL6","None","WL9","None","WL9"], "Income" : [12000,4500,36000,25000,12300,4500,7800,9800,5800], "Age" : [21,34,56,23,44,34,32,54,76], "Experience" : [2,5,1,3,12,8,8,4,6]})
Employees.head()

       Name Department Work Level  Income  Age  Experience
0  Shivance         IT        WL1   12000   21           2
1    Devika         HR        WL3    4500   34           5
2    Ayushi    Finance        WL2   36000   56           1
3     Punit  Marketing        WL5   25000   23           3
4   Krishna    Finance        WL6   12300   44          12

In [85]:
Employees["Income"].isnull() # It returns true if row has nan value.

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: Income, dtype: bool

In [87]:
Employees[Employees["Income"].isnull()]

Empty DataFrame
Columns: [Name, Department, Work Level, Income, Age, Experience]
Index: []

In order to fill missing values (nan),we can use fillna() method by giving spesific value.

In [90]:
income_nan = Employees[Employees["Income"].isnull()]
income_nan

Empty DataFrame
Columns: [Name, Department, Work Level, Income, Age, Experience]
Index: []

In [92]:
income_nan.fillna(1000) # It will fill all na values with 1000

Empty DataFrame
Columns: [Name, Department, Work Level, Income, Age, Experience]
Index: []

The new income values are float. Because nan values were float.We can change type after filling.

In [106]:
income_nan.fillna(Employees["Income"].mean()) # We can also give a statistical value. It is better generally.

Empty DataFrame
Columns: [Name, Department, Work Level, Income, Age, Experience]
Index: []

In [107]:
income_nan.fillna(Employees["Income"].median()) # We can also give a statistical value. It is better generally.

Empty DataFrame
Columns: [Name, Department, Work Level, Income, Age, Experience]
Index: []

We can also directly drop missing values with dropna() method. But in general, it is not preferred because it delete also information about dataset

In [108]:
Employees

       Name      Department Work Level  Income  Age Experince
0  Shivance              HR        WL1   45000   21         2
1    Devika         Finance        WL3    5600   32         5
2  Veshnavi       Marketing        WL2    7800   25      none
3   Shivani  Data Analytics        WL5    9800   45         7
4   Krishna          Finace        WL4   23000   36      none
5    Devika      Operations        WL6    5200   25         3
6   Krishna         Finance        WL9    6500   23         4
7    Ambika    Supply Chain        WL8   78900   65         6
8   Drashti  Data Analytics        WL7    6500   45         5

In [110]:
Employees.dropna() # It drops all na values.

       Name      Department Work Level  Income  Age Experince
0  Shivance              HR        WL1   45000   21         2
1    Devika         Finance        WL3    5600   32         5
2  Veshnavi       Marketing        WL2    7800   25      none
3   Shivani  Data Analytics        WL5    9800   45         7
4   Krishna          Finace        WL4   23000   36      none
5    Devika      Operations        WL6    5200   25         3
6   Krishna         Finance        WL9    6500   23         4
7    Ambika    Supply Chain        WL8   78900   65         6
8   Drashti  Data Analytics        WL7    6500   45         5

In [112]:
Employees.dropna(how="all") # It drops all na values if all variables in a row is na.

       Name      Department Work Level  Income  Age Experince
0  Shivance              HR        WL1   45000   21         2
1    Devika         Finance        WL3    5600   32         5
2  Veshnavi       Marketing        WL2    7800   25      none
3   Shivani  Data Analytics        WL5    9800   45         7
4   Krishna          Finace        WL4   23000   36      none
5    Devika      Operations        WL6    5200   25         3
6   Krishna         Finance        WL9    6500   23         4
7    Ambika    Supply Chain        WL8   78900   65         6
8   Drashti  Data Analytics        WL7    6500   45         5

In [114]:
Employees.dropna(axis = "columns") # We can drop columns if it has na value.

       Name      Department Work Level  Income  Age Experince
0  Shivance              HR        WL1   45000   21         2
1    Devika         Finance        WL3    5600   32         5
2  Veshnavi       Marketing        WL2    7800   25      none
3   Shivani  Data Analytics        WL5    9800   45         7
4   Krishna          Finace        WL4   23000   36      none
5    Devika      Operations        WL6    5200   25         3
6   Krishna         Finance        WL9    6500   23         4
7    Ambika    Supply Chain        WL8   78900   65         6
8   Drashti  Data Analytics        WL7    6500   45         5